src/test/resources/plays/payments/create.yaml

!play
interactions:
-
  request:
    uri: /v2/orders/ORD-HPMZSOM611M2/payments
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"PAY-KY4QPKGHZAC4","status":"IN_ANALYSIS","delayCapture": false,"amount":{"refunds":0,"fees":579,"liquid":6721,"currency":"BRL","total":7300},"installmentCount":1,"statementDescriptor":"sualoja.com","fundingInstrument":{"creditCard":{"id":"CRC-EALB0YZ0S04X","brand":"MASTERCARD","first6":"555566","last4":"8884","holder":{"birthdate":"10/10/1988","taxDocument":{"type":"CPF","number":"22222222222"},"billingAddress":{"street":"Rua 123","streetNumber":"321","complement":"AP X","district":"O Bairro","city":"A Cidade","state":"AC","country":"BRA","zipCode":"07863100"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":579}],"events":[{"createdAt":"2015-11-10T16:30:45-0200","type":"PAYMENT.IN_ANALYSIS"},{"createdAt":"2015-11-10T16:30:42-0200","type":"PAYMENT.CREATED"}],"_links":{"order":{"title":"ORD-HPMZSOM611M2","href":"https://sandbox.moip.com.br/v2/orders/ORD-HPMZSOM611M2"},"self":{"href":"https://sandbox.moip.com.br/v2/payments/PAY-KY4QPKGHZAC4"}},"createdAt":"2015-11-10T16:30:42-0200","updatedAt":"2015-11-10T16:30:45-0200"}
